'''
Задача D
++++++++

Метеорологи ведут многолетние наблюдения за тем, в каком году была минимальная температура в данный день года. Например,
абсолютный минимум температуры в Москве 8 марта был -32 градуса (1890).

В течение k лет метеорологи вели наблюдения за n днями года. Для каждого из этих n дней укажите минимальную температуру,
которая была в этот день за k лет наблюдений.

Первая строка входных данных содержит два числа k и n. Далее идет k строк, i-я строка содержит n чисел: значения
температур для n дней наблюдений i-го года.

Программа должна вывести n чисел: миниальное значение температуры для каждого из дней наблюдений.

+---------+-----------+
| Ввод    | Вывод     |
+=========+===========+
| 3       | 4 3 2 4 3 |
+---------+-----------+
| 8 6 4 7 |           |
+---------+-----------+
| 3 2 5 4 |           |
+---------+-----------+
| 6 4 6 3 |           |
+---------+-----------+
'''
input=open('input.txt', 'r')
output=open('output.txt', 'w')
dt = list(map(int, input.readline().split()))
k = dt[0]
n = dt[1]
min = [-1 for i in range(n)]
for i in range(k):
    Z= list(map(int, input.readline().split()))
    for j in range(n):
        if Z[j] < min[j] or min[j] == -1:
            min[j] = Z[j]
print(' '.join(map(str, min)), file=output)
